Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Glazing adjacent to the landing at the bottom of a stairway where the glazing is less than 36 inches (914 mm) above the landing and within a 60-inch (1524 mm) horizontal arc less than 180 degrees (3.14 rad) from the bottom tread nosing shall be considered to be a hazardous location.
fr_ca: Le vitrage adjacent au palier au bas d'un escalier où le vitrage est à moins de 36 po [914 mm] au-dessus du palier et dans un arc horizontal de 60 po [1524 mm] à moins de 180 degrés (3,14 rad) du nez de la marche inférieure doit être considéré comme un emplacement dangereux.

source: Glazing adjacent to the landing at the bottom of a stairway where the glazing is less than 60 inches (1524 mm) above the landing and within a 60-inch (1524 mm) horizontal arc that is less than 180 degrees (3.14 rad) from the bottom tread nosing shall be considered to be a hazardous location.
fr_ca: Les vitrages adjacents au palier au bas d’un escalier, lorsque le vitrage se trouve à moins de 60 po (1 524 mm) au-dessus du palier et à l’intérieur d’un arc horizontal de 60 po (1 524 mm) faisant moins de 180 degrés (3,14 rad) à partir du nez de la marche inférieure, doivent être considérés comme étant situés dans un emplacement dangereux.

source: Glazing in an individual fixed or operable panel adjacent to a door shall be considered to be a hazardous location where the bottom exposed edge of the glazing is less than 60 inches (1524 mm) above the floor or walking surface and it meets either of the following conditions:
fr_ca: Le vitrage d'un panneau individuel fixe ou ouvrant adjacent à une porte doit être considéré comme un emplacement dangereux lorsque le bord inférieur exposé du vitrage est à moins de 60 po [1524 mm] au-dessus du sol ou de la surface de circulation et qu'il satisfait à l'une des conditions suivantes :

source: Glazing in an individual fixed or operable panel that meets all of the following conditions shall be considered to be a hazardous location:
fr_ca: Le vitrage d'un panneau individuel fixe ou ouvrant qui satisfait à toutes les conditions suivantes doit être considéré comme un endroit dangereux :

source: Glazing in fixed and operable panels of swinging, sliding and bifold doors shall be considered to be a hazardous location.
fr_ca: Le vitrage dans les panneaux fixes et mobiles des portes battantes, coulissantes et pliantes doit être considéré comme un emplacement dangereux.

source: Glazing in railing in-fill panels shall be of an approved safety glazing material that conforms to the provisions of Section 2406.1.1.
fr_ca: Les vitrages des panneaux de remplissage des rampes doivent être constitués d’un matériau de vitrage de sécurité approuvé conforme aux dispositions de la section 2406.1.1.

source: Glazing in this application shall comply with Section 2406.4.3.
fr_ca: Le vitrage dans cette application doit être conforme à la section 2406.4.3.

source: Glazing in this application shall comply with Section R308.4.3.
fr_ca: Le vitrage dans cette application doit se conformer à la section R308.4.3.

source: Glazing installed in in-fill panels or balusters in windborne debris regions shall comply with the following:
fr_ca: Le vitrage installé dans les panneaux de remplissage ou les balustres dans les régions exposées aux débris transportés par le vent doit être conforme à ce qui suit :

source: Glazing materials shall not be installed in handrails or guards in parking garages except for pedestrian areas not exposed to impact from vehicles.
fr_ca: Les matériaux de vitrage ne doivent pas être installés dans les mains couranges ou les garde-corps dans les garages de stationnement, sauf dans les zones piétonnes non exposées aux impacts de véhicules.

source: Glazing not in doors or enclosures for hot tubs, whirlpools, saunas, steam rooms, bathtubs and showers shall be permitted to be tested in accordance with ANSI Z97.1.
fr_ca: Les vitrages qui ne sont pas intégrés à des portes ou à des enceintes pour cuves thermales, cuves à remous, saunas, bains de vapeur, baignoires et douches peuvent être soumis à des essais conformément à la norme ANSI Z97.1.

source: Glazing shall comply with the test criteria for Category II unless otherwise indicated in Table R308.3.1(1).
fr_ca: Le vitrage doit être conforme aux critères d'essai de la catégorie II, sauf indication contraire dans le tableau R308.3.1(1).

source: Glazing shall comply with the test criteria for Category II, unless otherwise indicated in Table 2406.2(1).
fr_ca: Le vitrage doit être conforme aux critères d'essai de la catégorie II, sauf indication contraire au tableau 2406.2(1).

source: Glazing shall comply with the test criteria for Class A unless otherwise indicated in Table R308.3.1(2).
fr_ca: Le vitrage doit être conforme aux critères d'essai de la Classe A, sauf indication contraire au tableau R308.3.1(2).

source: Glazing shall comply with the test criteria for Class A, unless otherwise indicated in Table 2406.2(2).
fr_ca: Le vitrage doit être conforme aux critères d'essai de la Classe A, sauf indication contraire au tableau 2406.2(2).

source: Glazing that is more than 60 inches (1524 mm), measured horizontally and in a straight line, from the water’s edge of a bathtub, hot tub, spa, whirlpool or swimming pool or from the edge of a shower, sauna or steam room.
fr_ca: Vitrage situé à plus de 60 po [1524 mm], mesuré horizontalement et en ligne droite, du bord de l’eau d’une baignoire, d’un spa, d’un bain à remous ou d’une piscine ou du bord d’une douche, d’un sauna ou d’un hammam.

source: Glazing that is more than 60 inches (1524 mm), measured horizontally and in a straight line, from the water’s edge of a bathtub, hot tub, spa, whirlpool or swimming pool.
fr_ca: Vitrage situé à plus de 60 po (1524 mm), mesuré horizontalement et en ligne droite, du bord de l’eau d’une baignoire, d’un bain tourbillon, d’un spa, d’un bain à remous ou d’une piscine.

source: Glazing that is protected by a guard complying with Sections 1015 and 1607.8 where the plane of the glass is greater than 18 inches (457 mm) from the guard.
fr_ca: Vitrage protégé par un garde-corps conforme aux sections 1015 et 1607.8 lorsque le plan de la vitre est à plus de 18 po (457 mm) du garde-corps.

source: Glazing where the bottom exposed edge of the glazing is less than 36 inches (914 mm) above the plane of the adjacent walking surface of stairways, landings between flights of stairs and ramps shall be considered to be a hazardous location.
fr_ca: Le vitrage dont le bord inférieur exposé est à moins de 36 po [914 mm] au-dessus du plan de la surface de marche adjacente des escaliers, des paliers entre les volées de marches et des rampes doit être considéré comme un endroit dangereux.

source: Glazing where the bottom exposed edge of the glazing is less than 60 inches (1524 mm) above the plane of the adjacent walking surface of stairways, landings between flights of stairs and ramps shall be considered to be a hazardous location.
fr_ca: Les vitrages dont le bord inférieur exposé se trouve à moins de 60 po (1 524 mm) au-dessus du plan de la surface de circulation adjacente des escaliers, des paliers entre les volées d’escaliers et des rampes doivent être considérés comme étant situés dans un emplacement dangereux.

source: Government buildings.
fr_ca: Bâtiments gouvernementaux.

source: Grab bars are not required to be installed in a shower for a single occupant, accessed only through a private office and not for common use or public use, provided reinforcement has been installed in walls and located so as to permit the installation of grab bars complying with Section 608.3.
fr_ca: Il n'est pas nécessaire d'installer des barres d'appui dans une douche à l'usage d'un occupant unique et non à usage commun ou public, et à laquelle on accède uniquement par un bureau privé, à condition que les murs aient été renforcés aux endroits permettant l'installation de barres d'appui conformément à l'article 608.3.

source: Grab bars for transfer type showers shall comply with Section 608.3.1.
fr_ca: Les barres d'appui pour les douches de type transfert doivent être conformes à la section 608.3.1.

source: Grab bars shall be 6 inches (150 mm) maximum from the adjacent wall.
fr_ca: Les barres d'appui doivent être situées à une distance maximale de 6 po [150 mm] du mur adjacent.

source: Grab bars shall comply with Section 609 and shall be provided in accordance with Section 607.4.1 or 607.4.2.
fr_ca: Les barres d'appui doivent être conformes à la section 609 et être prévues selon la section 607.4.1 ou 607.4.2.

source: Grab bars shall not be provided above the seat.
fr_ca: Il ne faut pas prévoir de barres d'appui au-dessus du siège.

source: Grab bars shall not be required to be installed in a bathing facility for a single occupant accessed only through a private office and not for common use or public use, provided reinforcement has been installed in walls and located so as to permit the installation of grab bars complying with Section 607.4.
fr_ca: Il n'est pas nécessaire d'installer des barres d'appui dans une installation de bain à l'usage d'un occupant unique et non à usage commun ou public, et à laquelle on accède uniquement par un bureau privé, à condition que les murs aient été renforcés aux endroits permettant l'installation de barres d'appui conformément à l'article 607.4.

source: Grease ducts shall be protected in accordance with the International Mechanical Code.
fr_ca: Les conduits de graisse doivent être protégés conformément à l'International Mechanical Code.

source: Greater than 120 inches (3050 mm)
fr_ca: Plus de 120 po [3050 mm]

source: Greater than 70 inches (1780 mm) to less than or equal to 120 inches (3050 mm)
fr_ca: Plus de 70 po (1780 mm) et 120 po (3050 mm) ou moins

source: Gripping surfaces shall be continuous, without interruption by newel posts, other construction elements, or obstructions.
fr_ca: Les surfaces de préhension doivent être continues, sans interruption par des poteaux de soutien, d'autres éléments de construction ou des obstacles.

source: Ground-fault circuit-interrupter protection shall be provided for outlets that supply dishwashers in dwelling unit locations.
fr_ca: Une protection par disjoncteur différentiel doit être prévue pour les prises qui alimentent les lave-vaisselle dans les logements.

source: Group A occupancies not separated from one another in accordance with Section 707.3.10 shall be considered as a single occupancy for the purposes of applying this section.
fr_ca: Les usages du groupe A qui ne sont pas séparés les uns des autres conformément à la section 707.3.10 doivent être considérés comme un seul usage aux fins de l’application de la présente section.

source: Group F, H, S or U occupancies.
fr_ca: Usages des groupes F, H, S ou U.

source: Group I-1 occupancies shall be equipped throughout with an automatic sprinkler system in accordance with Section 903.2.6.
fr_ca: Les usages du groupe I-1 doivent être entièrement équipés d'un système d'extincteurs automatiques selon la section 903.2.6.

source: Group R occupancies not constructed in accordance with the International Residential Code as permitted by Sections 310.4.1 and 310.4.2 shall comply with Section 420.
fr_ca: Les usages du groupe R qui ne sont pas construits conformément à l’International Residential Code, comme le permettent les sections 310.4.1 et 310.4.2, doivent être conformes à la section 420.

source: Group R-4 occupancies shall meet the requirements for construction as defined for Group R-3, except as otherwise provided for in this code.
fr_ca: Les occupations du groupe R-4 doivent satisfaire aux exigences de construction définies pour le groupe R-3, sauf disposition contraire du présent code.

source: Group U occupancies are not required to comply with this chapter other than the following:
fr_ca: Les usages du groupe U ne sont pas tenus d’être conformes au présent chapitre, à l’exception des éléments suivants :

source: Group homes
fr_ca: Foyers de groupe

source: Grout shall be prevented from bonding with the flue liner so that the flue liner is free to move with thermal expansion.
fr_ca: Il faut empêcher le coulis de se lier au revêtement du conduit de cheminée de manière à ce que le revêtement du conduit de cheminée puisse se déplacer librement en cas de dilatation thermique.

source: Guards adjacent to seating in a building, room or space used for assembly purposes shall be provided where required by Section 1015 and shall be constructed in accordance with Section 1015 except where provided in accordance with Sections 1030.17.1 through 1030.17.4.
fr_ca: Des garde-corps adjacents aux sièges dans un bâtiment, une pièce ou un espace utilisé à des fins d’assemblée doivent être prévus lorsque l’exige la section 1015 et doivent être construits conformément à la section 1015, sauf lorsqu’ils sont prévus conformément aux sections 1030.17.1 à 1030.17.4.

source: Guards shall be provided where required by Section 1015 and shall be constructed in accordance with Section 1015.
fr_ca: Des garde-corps doivent être prévus lorsque la section 1015 l'exige et ils doivent être construits selon la section 1015.

source: Guards with structural glass baluster panels shall be installed with an attached top rail or handrail.
fr_ca: Les garde-corps avec des panneaux de balustrade en verre structurel doivent être installés avec une traverse supérieure ou une main courante fixée.

source: Habitable rooms shall be not less than 7 feet (2134 mm) in any horizontal dimension.
fr_ca: Les pièces habitables ne doivent pas avoir de dimension horizontale inférieure à 7 pi [2134 mm].

source: Habitable rooms shall have a floor area of not less than 70 square feet (6.5 m2).
fr_ca: Les pièces habitables doivent avoir une surface de plancher d'au moins 70 pi2 [6,5 m2].

source: Habitable rooms shall have an aggregate glazing area of not less than 8 percent of the floor area of such rooms.
fr_ca: Les pièces habitables doivent avoir une surface vitrée totale d'au moins 8 pour cent de la surface de plancher de ces pièces.

source: Habitable space, hallways and portions of basements containing these spaces shall have a ceiling height of not less than 7 feet (2134 mm).
fr_ca: La hauteur de plafond dans les lieux habitables, les corridors et les parties de sous-sol contenant ces lieux ne doit pas être inférieure à 7 pi [2134 mm].

source: Habitable spaces, other than a kitchen, shall be not less than 7 feet (2134 mm) in any plan dimension.
fr_ca: Les lieux habitables, autres qu'une cuisine, ne doivent pas avoir moins de 7 pi (2134 mm) dans toute dimension en vue en plan.

source: Halfway houses
fr_ca: Maisons de transition

source: Hall signals shall comply with Section 407.2.2.
fr_ca: Les signaux d’appel doivent être conformes à la section 407.2.2.

source: Hand operated flush controls shall comply with Section 309.
fr_ca: Les mécanismes de chasse manuels doivent être conformes à la section 309.

source: Hand-operated flush controls shall be located on the open side of the water closet.
fr_ca: Les mécanismes de chasse manuels doivent être situés sur le côté dégagé de la cabine de toilette.

source: Handrail brackets or balusters attached to the bottom surface of the handrail shall not be considered obstructions, provided the brackets or balusters comply with the following criteria:
fr_ca: Les supports de rampe ou les balustres fixés à la surface inférieure de la rampe ne doivent pas être considérés comme des obstacles, à condition que les supports ou les balustres soient conformes aux critères suivants :

source: Handrail extensions are not required.
fr_ca: Les extensions de mains courantes ne sont pas exigées.

source: Handrail extensions shall not be required in aisles serving seating where the handrails are discontinuous to provide access to seating and to permit cross-overs within the aisle.
fr_ca: Des prolongements de rampes ne sont pas exigés dans les allées desservant des SIÈGES où les rampes sont discontinues pour permettre l'accès aux SIÈGES et pour permettre les passages dans l'allée.

source: Handrails and handrail extensions shall be marked with a solid and continuous stripe having a minimum width of 1 inch (25 mm).
fr_ca: Les mains courantes et les extensions de mains courantes doivent être marquées d'une bande pleine et continue d'une largeur minimale de 1 po (25 mm).

source: Handrails and handrail supports that are provided on the ramp run shall not project into the required clear width of the ramp run.
fr_ca: Les rampes et les supports de rampes qui sont prévus sur la course de la rampe ne doivent pas faire saillie dans la largeur libre exigée de la course de la rampe.

source: Handrails are permitted to project into the required width of stepped aisles and ramped aisles in accordance with Section 1014.8.
fr_ca: Les mains courantes peuvent faire saillie dans la largeur requise des allées en paliers et des allées en rampe selon la section 1014.8.

source: Handrails located on the side of stepped aisles shall return to a wall, guard or the walking surface or shall be continuous to the handrail of an adjacent stepped aisle flight.
fr_ca: Les mains courantes situées sur le côté des allées à gradins doivent revenir jusqu’à un mur, un garde-corps ou la surface de circulation, ou être continues jusqu’à la main courante de la volée adjacente de l’allée à gradins.

source: Handrails required by Section 405.8 for ramps, Section 504.7 for stairs, Section 1009.3.3 for pool sloped entries and Section 1009.6.2 for pool stairs shall comply with Section 505.
fr_ca: Les rampes exigées par l'article 405.8 pour les rampes, l'article 504.7 pour les escaliers, l'article 1009.3.3 pour les entrées en pente de piscine et l'article 1009.6.2 pour les escaliers de piscine doivent être conformes à la section 505.

source: Handrails shall be at a consistent height above stair nosings, ramp surfaces and walking surfaces.
fr_ca: Les rampes doivent être à une hauteur constante au-dessus des nez de marche, des surfaces de rampe et des surfaces de circulation.

source: Handrails shall be continuous within the full length of each stair flight or ramp run.
fr_ca: Les rampes doivent être continues sur toute la longueur de chaque volée d'escalier ou course de rampe.

source: Handrails shall be provided on both sides of stairs and ramps.
fr_ca: Il faut prévoir des rampes des deux côtés des escaliers et des rampes.

source: Handrails shall comply with Section 1014.
fr_ca: Les mains courantes doivent être conformes à la section 1014.

source: Handrails shall extend beyond and in the same direction of stair flights and ramp runs in accordance with Section 505.10.
fr_ca: Les rampes doivent se prolonger au-delà et dans la même direction que les volées d'escaliers et les rampes selon la section 505.10.

source: Handrails shall have a cross section complying with Section 505.7.1 or 505.7.2.
fr_ca: En coupe transversale, les rampes doivent être conformes aux articles 505.7.1 ou 505.7.2.

source: Handrails shall not be required to be continuous in aisles serving seating where handrails are discontinuous to provide access to seating and to permit crossovers within the aisles.
fr_ca: Les rampes ne sont pas tenues d'être continues dans les allées desservant des sièges où les rampes sont discontinues pour permettre l'accès aux sièges et pour permettre les croisements dans les allées.

source: Handrails shall not rotate within their fittings.
fr_ca: Les rampes ne doivent pas tourner dans leurs fixations.

source: Handrails with a circular cross section shall have an outside diameter of 11/4 inches (32 mm) minimum and 2 inches (51 mm) maximum.
fr_ca: Le diamètre extérieur minimal et maximal des rampes à coupe transversale circulaire est de 11/4 po [32 mm] et 2 po [51 mm], respectivement.

source: Handrails with a noncircular cross section shall have a perimeter dimension of 4 inches (100 mm) minimum and 61/4 inches (160 mm) maximum, and a cross-section dimension of 21/4 inches (57 mm) maximum.
fr_ca: Dans le cas des rampes dont la coupe transversale n'est pas circulaire, les dimensions minimale et maximale du périmètre de la rampe sont de 4 po [100 mm] et 61/4 po [160 mm], respectivement, et la dimension maximale en coupe est de 21/4 po [57 mm].

source: Handrails, and any wall or other surfaces adjacent to them, shall be free of any sharp or abrasive elements.
fr_ca: Les rampes et tout mur ou toute autre surface adjacente à celles-ci doivent être exempts d'éléments acérés ou abrasifs.

source: Handrails, intermediate landings and edge protection shall not be required where the sides of ramp runs have a vertical drop off of 1/2 inch (13 mm) maximum within 10 inches (255 mm) horizontally of the ramp run.
fr_ca: Les mains courantes, les paliers intermédiaires et les dispositifs de protection des bords ne sont pas requis lorsque les côtés des volées de rampe présentent une dénivellation verticale d’au plus 1/2 pouce (13 mm) sur une distance horizontale d’au plus 10 pouces (255 mm) à partir de la volée de rampe.

source: Hardware on opening protectives shall be of an approved type installed as tested, except that approved interlocks, mechanical locks and electric contacts, door and gate electric contacts and door-operating mechanisms shall be exempt from the fire test requirements.
fr_ca: La quincaillerie des protections d'ouvertures doit être d’un type approuvé et installée conformément aux résultats des essais, à l’exception des dispositifs d’interverrouillage approuvés, des verrous mécaniques et des contacts électriques, des contacts électriques des portes et des barrières, ainsi que des mécanismes de commande des portes, qui sont exemptés des exigences relatives aux essais au feu.

source: Hearth extension(each side of opening)
fr_ca: Extension du foyer (de chaque côté de l'ouverture)

source: Hearth extension(front of opening)
fr_ca: Extension du foyer (avant de l'ouverture)

source: Hearth extensions shall extend not less than 16 inches (406 mm) in front of and not less than 8 inches (203 mm) beyond each side of the fireplace opening.
fr_ca: Les extensions de foyer doivent se prolonger d'au moins 16 po [406 mm] devant et d'au moins 8 po [203 mm] au-delà de chaque côté de l'ouverture du foyer.

source: Hearth slab reinforcing
fr_ca: Renforcement de la dalle du foyer

source: Hearth slab thickness
fr_ca: Épaisseur de la dalle du foyer

source: Heights shall comply with Table 703.2.4, based on the size of the characters on the sign.
fr_ca: Les hauteurs doivent être conformes au Tableau 703.2.4, en fonction de la taille des caractères sur l'enseigne.

source: High-rise buildings shall comply with Sections 403.2 through 403.6.
fr_ca: Les bâtiments de grande hauteur doivent être conformes aux articles 403.2 à 403.6.

source: Highway tollbooths where the access is provided only by bridges above the vehicular traffic or underground tunnels are not required to comply with this chapter.
fr_ca: Les postes de péage autoroutier dont l’accès est assuré uniquement par des passerelles situées au-dessus de la circulation des véhicules ou par des tunnels souterrains ne sont pas tenus d’être conformes au présent chapitre.

source: Hoistway doors or gates shall be permitted to be of the self-closing, manual type, where that door or gate provides access to a narrow end of the car that serves only one landing.
fr_ca: Les portes ou portillons de la gaine peuvent être de type manuel à fermeture automatique, lorsque cette porte ou ce portillon donne accès à une extrémité étroite de la cabine qui ne dessert qu'un seul palier.

source: Horizontal assemblies at smoke barriers constructed in accordance with Section 709.
fr_ca: Les ensembles horizontaux au niveau des barrières anti-fumée construites selon la section 709.
